_Rarzrabotki/Rarus/USO2/Catalogs/уатУчетныеЗаписиСистемыМониторинга.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Catalog>
		<Properties>
			<Name>уатУчетныеЗаписиСистемыМониторинга</Name>
			<Comment>(уат)</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>СистемаМониторинга</Name>
					<Comment>Система мониторинга (уат)</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.уатСистемаGPS</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресСервиса</Name>
					<Comment>Адрес сервиса системы мониторинга (уат)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Логин</Name>
					<Comment>Логин в системе мониторинга (уат)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пароль</Name>
					<Comment>Пароль в системе мониторинга (уат)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТокенАвторизации</Name>
					<Comment>Токен авторизации в системе мониторинга (уат)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>72</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сервер</Name>
					<Comment>Имя сервера базы данных (уат)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидСистемы</Name>
					<Comment>Вид системы (уат)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособРаботы</Name>
					<Comment>Способ работы (уат)</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.уатСпособРаботыСOmnicomm</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособПодключения</Name>
					<Comment>Способ подключения (уат)</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.уатСпособПодключенияКOmnicomm</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяБД</Name>
					<Comment>Имя базы данных (уат)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Драйвер</Name>
					<Comment>Название драйвера ODBC (уат)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяPIPE</Name>
					<Comment>Имя PIPE (уат)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяDSN</Name>
					<Comment>Имя DSN (уат)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ресурс</Name>
					<Comment>Имя ресурса (уат)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Enums/уатСистемаGPS.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>уатСистемаGPS</Name>
			<Comment>Cистема мониторинга (уат)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>_1СЦСМ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Dynafleet</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Omnicomm</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Wialon</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АвтоГРАФ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Автотрекер</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СКАУТ</Name>
					<Comment>СКАУТ</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Enums/уатСпособРаботыСOmnicomm.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>уатСпособРаботыСOmnicomm</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВебСервис</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БД</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Enums/уатСпособПодключенияКOmnicomm.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>уатСпособПодключенияКOmnicomm</Name>
			<Comment>Способ подключения к omnicomm (уат)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>СтандартноеПодключение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>PIPEПодключение</Name>
					<Comment>Подключение через PIPE</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>DSNПодключение</Name>
					<Comment>Подключение через DSN</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Catalogs/уатУчетныеЗаписиСистемыМониторинга/Forms/ФормаЭлемента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	об = РеквизитФормыВЗначение("Объект");
	уатЗащищенныеФункцииСервер.уатСправочникФормаЭлементаПриСозданииНаСервере(Об, Отказ, СтандартнаяОбработка, ЭтотОбъект, ДопПараметрыОткрытие);
	ЗначениеВРеквизитФормы(Об,"Объект");
	
	Если Отказ тогда
		Возврат;
	КонецЕсли;
	
	Если Параметры.Свойство("СистемаМониторинга") Тогда
		ПереданнаяСистемаМониторинга = Параметры.СистемаМониторинга;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	уатЗащищенныеФункцииКлиент.уатСправочникФормаЭлементаПриОткрытии(Отказ, ДопПараметрыОткрытие);
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьВидимость();
	ОбновитьСписокВыбораИспользуемойСистемыМониторинга();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПолучитьТокен(Команда)
	
	Если Объект.СистемаМониторинга = ПредопределенноеЗначение("Перечисление.уатСистемаGPS.Wialon") Тогда
		ПолучитьТокенWialon();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьПодключение(Команда)
	
	Если Объект.СистемаМониторинга = ПредопределенноеЗначение("Перечисление.уатСистемаGPS.Omnicomm") Тогда
		ПроверитьПодключениеOmnicomm();
	ИначеЕсли Объект.СистемаМониторинга = ПредопределенноеЗначение("Перечисление.уатСистемаGPS.Wialon") Тогда
		ПроверитьПодключениеWialon();
	ИначеЕсли Объект.СистемаМониторинга = ПредопределенноеЗначение("Перечисление.уатСистемаGPS.АвтоГРАФ") Тогда
		ПроверитьПодключениеАвтоГРАФ();
	ИначеЕсли Объект.СистемаМониторинга = ПредопределенноеЗначение("Перечисление.уатСистемаGPS.СКАУТ") Тогда
		ПроверитьПодключениеСКАУТ();
	Иначе
		ИдентификаторДействия = "Справочник.уатУчетныеЗаписиСистемыМониторинга.ПроверитьПодключение";
		уатРаботаСРасширениямиКлиент.ПСМ_ВыполнитьДействияВФорме(ИдентификаторДействия, Объект.СистемаМониторинга,Объект.Ссылка,ЭтотОбъект);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура СистемаМониторингаПриИзменении(Элемент)
	
	УстановитьВидимость();
	
	Объект.Логин				 = Неопределено;
	Объект.Пароль				 = Неопределено;
	Объект.АдресСервиса			 = Неопределено;
	Объект.ТокенАвторизации		 = Неопределено;
	Объект.СпособРаботы			 = Неопределено;
	Объект.СпособПодключения	 = Неопределено;
	Объект.Сервер				 = Неопределено;
	Объект.ИмяБД				 = Неопределено;
	Объект.Драйвер				 = Неопределено;
	Объект.ИмяPIPE				 = Неопределено;
	Объект.ИмяDSN				 = Неопределено;
	Объект.Ресурс				 = Неопределено;
	Объект.ВидСистемы			 = Неопределено;

КонецПроцедуры

&НаКлиенте
Процедура РесурсНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Если Объект.СистемаМониторинга = ПредопределенноеЗначение("Перечисление.уатСистемаGPS.Wialon") Тогда
		ОбновитьСписокВыбораРесурсаWialon();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СпособПодключенияПриИзменении(Элемент)
	УстановитьВидимость();
КонецПроцедуры

&НаКлиенте
Процедура СпособРаботыПриИзменении(Элемент)
	УстановитьВидимость();
КонецПроцедуры

&НаКлиенте
Процедура ВидСистемыПриИзменении(Элемент)
	Элементы.ПроверитьПодключение.Видимость	 = Объект.ВидСистемы = 0;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОбновитьСписокВыбораИспользуемойСистемыМониторинга()
	Элементы.СистемаМониторинга.СписокВыбора.Очистить();
	Если уатОбщегоНазначения_проф.ПолучитьЗначениеКонстанты("уатИспользоватьDynafleet") 
		ИЛИ ПереданнаяСистемаМониторинга = ПредопределенноеЗначение("Перечисление.уатСистемаGPS.Dynafleet") Тогда
		Элементы.СистемаМониторинга.СписокВыбора.Добавить(ПредопределенноеЗначение("Перечисление.уатСистемаGPS.Dynafleet"));
	КонецЕсли;
	Если уатОбщегоНазначения_проф.ПолучитьЗначениеКонстанты("уатИспользоватьOmnicomm") 
		ИЛИ ПереданнаяСистемаМониторинга = ПредопределенноеЗначение("Перечисление.уатСистемаGPS.Omnicomm") Тогда
		Элементы.СистемаМониторинга.СписокВыбора.Добавить(ПредопределенноеЗначение("Перечисление.уатСистемаGPS.Omnicomm"));
	КонецЕсли;
	Если уатОбщегоНазначения_проф.ПолучитьЗначениеКонстанты("уатИспользоватьWialon")
		ИЛИ ПереданнаяСистемаМониторинга = ПредопределенноеЗначение("Перечисление.уатСистемаGPS.Wialon")Тогда
		Элементы.СистемаМониторинга.СписокВыбора.Добавить(ПредопределенноеЗначение("Перечисление.уатСистемаGPS.Wialon"));
	КонецЕсли;
	Если уатОбщегоНазначения_проф.ПолучитьЗначениеКонстанты("уатИспользоватьАвтоГРАФ")
		ИЛИ ПереданнаяСистемаМониторинга = ПредопределенноеЗначение("Перечисление.уатСистемаGPS.АвтоГРАФ") Тогда
		Элементы.СистемаМониторинга.СписокВыбора.Добавить(ПредопределенноеЗначение("Перечисление.уатСистемаGPS.АвтоГРАФ"));
	КонецЕсли;
	Если уатОбщегоНазначения_проф.ПолучитьЗначениеКонстанты("уатИспользоватьСКАУТ")
		ИЛИ ПереданнаяСистемаМониторинга = ПредопределенноеЗначение("Перечисление.уатСистемаGPS.СКАУТ") Тогда
		Элементы.СистемаМониторинга.СписокВыбора.Добавить(ПредопределенноеЗначение("Перечисление.уатСистемаGPS.СКАУТ"));
	КонецЕсли;
	МассивПСМ = Новый Массив();
	уатРаботаСРасширениями.ПСМ_ЗаполнитьМассивПСМ(МассивПСМ);
	Для Каждого ТекСтрока Из МассивПСМ Цикл
		Элементы.СистемаМониторинга.СписокВыбора.Добавить(ТекСтрока);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимость()
	
	Элементы.СпособРаботы.Видимость			 = Ложь;
	Элементы.СпособПодключения.Видимость	 = Ложь;
	Элементы.Логин.Видимость				 = Ложь;
	Элементы.Пароль.Видимость				 = Ложь;
	Элементы.АдресСервиса.Видимость			 = Ложь;
	Элементы.Сервер.Видимость				 = Ложь;
	Элементы.ИмяБД.Видимость				 = Ложь;
	Элементы.Драйвер.Видимость				 = Ложь;
	Элементы.ИмяPIPE.Видимость				 = Ложь;
	Элементы.ИмяDSN.Видимость				 = Ложь;
	Элементы.ИмяDSN.Видимость				 = Ложь;
	Элементы.ГруппаТокен.Видимость			 = Ложь;
	Элементы.Ресурс.Видимость				 = Ложь;
	Элементы.ВидСистемы.Видимость			 = Ложь;
	Элементы.ПроверитьПодключение.Видимость	 = Истина;
	
	Если Объект.СистемаМониторинга = ПредопределенноеЗначение("Перечисление.уатСистемаGPS.Omnicomm") Тогда
		Элементы.АдресСервиса.ПодсказкаВвода = Нстр("en = 'Например: http://frodo.online.omnicomm.ru:8001/'; ru = 'Например: http://frodo.online.omnicomm.ru:8001/'");
		Элементы.СпособРаботы.Видимость = Истина;
		Если Объект.СпособРаботы = ПредопределенноеЗначение("Перечисление.уатСпособРаботыСOmnicomm.БД") Тогда
			Элементы.СпособПодключения.Видимость	 = Истина;
			Элементы.ПроверитьПодключение.Видимость	 = Ложь;
			
			Если Объект.СпособПодключения = ПредопределенноеЗначение("Перечисление.уатСпособПодключенияКOmnicomm.СтандартноеПодключение") Тогда
				Элементы.Логин.Видимость   = Истина;
				Элементы.Пароль.Видимость  = Истина;
				Элементы.Сервер.Видимость  = Истина;
				Элементы.ИмяБД.Видимость   = Истина;
				Элементы.Драйвер.Видимость = Истина;
			ИначеЕсли Объект.СпособПодключения = ПредопределенноеЗначение("Перечисление.уатСпособПодключенияКOmnicomm.PIPEПодключение") Тогда
				Элементы.Логин.Видимость   = Истина;
				Элементы.Пароль.Видимость  = Истина;
				Элементы.Сервер.Видимость  = Истина;
				Элементы.ИмяБД.Видимость   = Истина;
				Элементы.Драйвер.Видимость = Истина;
				Элементы.ИмяPIPE.Видимость = Истина;
			ИначеЕсли Объект.СпособПодключения = ПредопределенноеЗначение("Перечисление.уатСпособПодключенияКOmnicomm.DSNПодключение") Тогда
				Элементы.ИмяDSN.Видимость  = Истина;
			КонецЕсли;
			
		ИначеЕсли Объект.СпособРаботы = ПредопределенноеЗначение("Перечисление.уатСпособРаботыСOmnicomm.ВебСервис") Тогда
			Элементы.Логин.Видимость             = Истина;
			Элементы.Пароль.Видимость            = Истина;
			Элементы.АдресСервиса.Видимость      = Истина;
		КонецЕсли;
	ИначеЕсли Объект.СистемаМониторинга = ПредопределенноеЗначение("Перечисление.уатСистемаGPS.Wialon") Тогда
		Если Объект.ВидСистемы = 0 Тогда 
			Элементы.АдресСервиса.ПодсказкаВвода = НСтр("ru = 'Например: http://hst-api.wialon.com/'");
		Иначе 
			Элементы.АдресСервиса.ПодсказкаВвода = НСтр("ru = 'Например: http://wtest.gurtam.com/'");
		КонецЕсли;
		Элементы.ГруппаТокен.Видимость	 = Истина;
		Элементы.Ресурс.Видимость		 = Истина;
		Элементы.ВидСистемы.Видимость	 = Истина;
		Элементы.АдресСервиса.Видимость	 = Истина;
		ОбновитьСписокВыбораРесурсаWialon();
		Объект.СистемаМониторинга = ПредопределенноеЗначение("Перечисление.уатСистемаGPS.Wialon");
	ИначеЕсли Объект.СистемаМониторинга = ПредопределенноеЗначение("Перечисление.уатСистемаGPS.Dynafleet") Тогда
		Элементы.АдресСервиса.ПодсказкаВвода = "";
		Элементы.ПроверитьПодключение.Видимость = Ложь;
		Элементы.Логин.Видимость		 = Истина;
		Элементы.Пароль.Видимость		 = Истина;
		Элементы.АдресСервиса.Видимость	 = Истина;
	ИначеЕсли Объект.СистемаМониторинга = ПредопределенноеЗначение("Перечисление.уатСистемаGPS.АвтоГРАФ") Тогда
		Элементы.АдресСервиса.ПодсказкаВвода = НСтр("ru = 'Например: http://192.168.0.1:24800/'");
		Элементы.АдресСервиса.Видимость	 = Истина;
	ИначеЕсли Объект.СистемаМониторинга = ПредопределенноеЗначение("Перечисление.уатСистемаGPS.СКАУТ") Тогда
		Элементы.Логин.Видимость		 = Истина;
		Элементы.Пароль.Видимость		 = Истина;
		Элементы.АдресСервиса.Видимость	 = Истина;
	Иначе
		ИдентификаторДействия = "Справочник.уатУчетныеЗаписиСистемыМониторинга.УстановитьВидимость";
		уатРаботаСРасширениямиКлиент.ПСМ_ВыполнитьДействияВФорме(ИдентификаторДействия, Объект.СистемаМониторинга,,ЭтотОбъект);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьТокенWialonЗавершение(Результат, ДопПараметры) Экспорт
	
	Если Результат = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	Объект.ТокенАвторизации = Результат;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьСписокВыбораРесурсаWialon()
	
	СтруктураWialon = Новый Структура("уатТокенВСистемеWialon, уатАдресСервисаWialon", Объект.ТокенАвторизации, Объект.АдресСервиса);
	СписокРесурсовWialon = уатЗащищенныеФункцииСервер_проф.Wialon_ПолучитьСписокРесурсов(СтруктураWialon, Объект);
	
	Для Каждого ТекСтрока Из СписокРесурсовWialon Цикл 
		Если Элементы.Ресурс.СписокВыбора.НайтиПоЗначению(ТекСтрока.Значение) = Неопределено Тогда 
			Элементы.Ресурс.СписокВыбора.Добавить(ТекСтрока.Значение, ТекСтрока.Представление);
		КонецЕсли;
	КонецЦикла;
	
	мсвУдаляемыеЭлементы = Новый Массив();
	Для Каждого ТекСтрока Из Элементы.Ресурс.СписокВыбора Цикл 
		Если СписокРесурсовWialon.НайтиПоЗначению(ТекСтрока.Значение) = Неопределено Тогда 
			мсвУдаляемыеЭлементы.Добавить(ТекСтрока);
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого УдаляемыйЭлемент Из мсвУдаляемыеЭлементы Цикл 
		Элементы.Ресурс.СписокВыбора.Удалить(УдаляемыйЭлемент);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьПодключениеWialon()
	
	УдалитьНезначащиеСимволыВНастройках();
	
	ОшибкаЗаполнения = Ложь;
	
	Если Не ЗначениеЗаполнено(Объект.ТокенАвторизации) Тогда 
		ТекстОшибки = НСтр("en='To verify connection, you must specify the authorization token';ru='Для проверки подключения необходимо указать токен авторизации'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки,, "Объект.ТокенАвторизации",, ОшибкаЗаполнения);
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.АдресСервиса) Тогда 
		ТекстОшибки = НСтр("en='To check the connection it is necessary to specify address of service ""Wialon hosting""';ru='Для проверки подключения необходимо указать адрес сервиса ""Wialon hosting""'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки,, "Объект.АдресСервиса",, ОшибкаЗаполнения);
	КонецЕсли;
	
	Если ОшибкаЗаполнения Тогда 
		Возврат;
	КонецЕсли;
	
	Если Не ПодключениеКWialonДоступно() Тогда 
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.Ресурс) Тогда 
		ОбновитьСписокВыбораРесурсаWialon();
		Если Элементы.Ресурс.СписокВыбора.Количество() Тогда 
			Объект.Ресурс = Элементы.Ресурс.СписокВыбора[0].Значение;
		КонецЕсли;
	КонецЕсли;
	
	ПоказатьПредупреждение(, НСтр("en='Connection check is completed successfully.';ru='Проверка подключения успешно завершена.'"));
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьПодключениеOmnicomm()
	
	Если Не Объект.СпособРаботы = ПредопределенноеЗначение("Перечисление.уатСпособРаботыСOmnicomm.ВебСервис") Тогда 
		Возврат;
	КонецЕсли;
	
	УдалитьНезначащиеСимволыВНастройках();
	
	ОшибкаЗаполнения = Ложь;
	
	Если Не ЗначениеЗаполнено(Объект.АдресСервиса) Тогда 
		ТекстОшибки = НСтр("en='It is necessary to specify address of service Omnicomm.';ru='Необходимо указать адрес сервиса Omnicomm.'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки,, "Объект.АдресСервиса",, ОшибкаЗаполнения);
	КонецЕсли;
	
	Если ОшибкаЗаполнения Тогда 
		Возврат;
	КонецЕсли;
	
	Если Не ПодключениеКOmnicommДоступно() Тогда 
		Возврат;
	КонецЕсли;
	
	ПоказатьПредупреждение(, НСтр("en='Connection check is completed successfully.';ru='Проверка подключения успешно завершена.'"));
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьПодключениеАвтоГРАФ()
	
	УдалитьНезначащиеСимволыВНастройках();
	
	ОшибкаЗаполнения = Ложь;
	
	Если Не ЗначениеЗаполнено(Объект.АдресСервиса) Тогда 
		ТекстОшибки = НСтр("en='It is necessary to specify service address of AvtoGRAF.';ru='Необходимо указать адрес сервиса АвтоГРАФ.'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки,, "Объект.АдресСервиса",, ОшибкаЗаполнения);
	КонецЕсли;
	
	Если ОшибкаЗаполнения Тогда 
		Возврат;
	КонецЕсли;
	
	Если Модифицированность Тогда 
		ТекстОшибки = НСтр("en='To check connection, you must save the changes';ru='Для проверки подключения необходимо сохранить изменения'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
		Возврат;
	КонецЕсли;
	
	Если Не ПодключениеКАвтоГРАФДоступно() Тогда 
		Возврат;
	КонецЕсли;
	
	ПоказатьПредупреждение(, НСтр("en='Connection check is completed successfully.';ru='Проверка подключения успешно завершена.'"));
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьПодключениеСКАУТ()
	
	УдалитьНезначащиеСимволыВНастройках();
	
	ОшибкаЗаполнения = Ложь;
	
	Если Не ЗначениеЗаполнено(Объект.АдресСервиса) Тогда 
		ТекстОшибки = НСтр("en='It is necessary to specify address of service SKAUT.';ru='Необходимо указать адрес сервиса СКАУТ.'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки,, "Объект.АдресСервиса",, ОшибкаЗаполнения);
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.Логин) Тогда 
		ТекстОшибки = НСтр("en='It is necessary to specify username for authorization in SKAUT service.';ru='Необходимо указать логин для авторизации в сервисе СКАУТ.'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки,, "Объект.Логин",, ОшибкаЗаполнения);
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.Пароль) Тогда 
		ТекстОшибки = НСтр("en='It is necessary to specify password for authorization in SKAUT service.';ru='Необходимо указать пароль для авторизации в сервисе СКАУТ.'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки,, "Объект.Пароль",, ОшибкаЗаполнения);
	КонецЕсли;
	
	Если ОшибкаЗаполнения Тогда 
		Возврат;
	КонецЕсли;
	
	Если Не ПодключениеКСКАУТДоступно() Тогда 
		Возврат;
	КонецЕсли;
	
	ПоказатьПредупреждение(, НСтр("en='Connection check is completed successfully.';ru='Проверка подключения успешно завершена.'"));
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьНезначащиеСимволыВНастройках()
	
	ЗаменитьНезначащиеСимволы(Объект.Логин);
	ЗаменитьНезначащиеСимволы(Объект.Пароль);
	ЗаменитьНезначащиеСимволы(Объект.АдресСервиса);
	ЗаменитьНезначащиеСимволы(Объект.ТокенАвторизации);
	ЗаменитьНезначащиеСимволы(Объект.ИмяБД);
	ЗаменитьНезначащиеСимволы(Объект.Драйвер);
	ЗаменитьНезначащиеСимволы(Объект.ИмяPIPE);
	ЗаменитьНезначащиеСимволы(Объект.ИмяDSN);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаменитьНезначащиеСимволы(ЗначениеНастройки)
	
	НовоеЗначение = ЗначениеНастройки;
	
	НовоеЗначение = СтрЗаменить(НовоеЗначение, Символы.ПС, "");
	
	НовоеЗначение = СтрЗаменить(НовоеЗначение, Символ(182), "");
	
	НовоеЗначение = СокрЛП(НовоеЗначение);
	
	ЗначениеНастройки = НовоеЗначение;
	
КонецПроцедуры

&НаСервере
Функция ПодключениеКСКАУТДоступно()
	
	ТабДанных   = Неопределено;
	ТекстОшибки = "";
	
	КодВозврата = уатЗащищенныеФункцииСервер_проф.ПолучитьОписаниеТССКАУТЧерезВебСервис(ТабДанных, ТекстОшибки, Объект);
	
	Если КодВозврата = 0 И ТекстОшибки = "" Тогда 
		Возврат Истина;
	Иначе 
		ТекстОшибки = НСтр("ru='По указанному адресу отсутствует возможность подключения к функциям API СКАУТ'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

&НаСервере
Функция ПодключениеКАвтоГРАФДоступно()
	
	ТабДанных   = Неопределено;
	ТекстОшибки = "";
	
	КодВозврата = уатЗащищенныеФункцииСервер_проф.АвтоГРАФ_ПолучитьДанныеВсехТС(ТабДанных, ТекстОшибки, Объект);
	
	Если КодВозврата = 0 И ТекстОшибки = "" Тогда 
		Возврат Истина;
	Иначе 
		ТекстОшибки = НСтр("ru='По указанному адресу отсутствует возможность подключения к функциям API АвтоГРАФ'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

&НаСервере
Функция ПодключениеКOmnicommДоступно()
	
	ТабДанных   = Неопределено;
	ТекстОшибки = "";
	
	КодВозврата = уатЗащищенныеФункцииСервер_проф.Omnicomm_ПолучитьДанныеВсехТС(ТабДанных, ТекстОшибки, Объект);
	
	Если КодВозврата = 0 И ТекстОшибки = "" Тогда 
		Возврат Истина;
	Иначе 
		ТекстОшибки = НСтр("ru='По указанному адресу отсутствует возможность подключения к функциям API Omnicomm'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Функция ПодключениеКWialonДоступно()
	
	ТекстОшибки = "";
	
	КодВозврата = ПроверитьПодключениеWialonНаСервере(ТекстОшибки);
	
	Если КодВозврата = 0 И ТекстОшибки = "" Тогда 
		Возврат Истина;
		
	ИначеЕсли КодВозврата = 2 Тогда 
		ПараметрыФормы = Новый Структура();
		ПараметрыФормы.Вставить("Описание", ТекстОшибки + Символы.ПС + НСтр("ru='Продолжить?';en='Do you want to continue?'"));
		ПараметрыФормы.Вставить("ПредупреждениеWialon", Истина);
		
		ОткрытьФорму(
			"ОбщаяФорма.уатПредупреждение", 
			ПараметрыФормы, 
			ЭтотОбъект,
			,
			,
			,
			Новый ОписаниеОповещения("ПодтверждениеЗагрузкиИзLocal", ЭтотОбъект),
			РежимОткрытияОкнаФормы.БлокироватьОкноВладельца
		);
		
		Возврат Ложь;
		
	Иначе 
		ТекстОшибки = СтрШаблон(НСтр("en='At the address <%1> is missing the ability to connect to the API functions WIALON';ru='По указанному адресу <%1> отсутствует возможность подключения к функциям API WIALON'"), Объект.АдресСервиса);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки,, "НаборКонстант.уатАдресСервисаWialon");
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

&НаСервере
Функция ПроверитьПодключениеWialonНаСервере(ТекстОшибки)
	
	ТабДанных = Неопределено;
	
	Возврат уатЗащищенныеФункцииСервер_проф.Wialon_ПолучитьДанныеВсехТС(ТабДанных, ТекстОшибки,,Объект);
	Возврат 1;
	
КонецФункции

&НаКлиенте
Процедура ПодтверждениеЗагрузкиИзLocal(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
	
	Если РезультатЗакрытия = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	Если РезультатЗакрытия.БольшеНеПоказывать Тогда 
		СохранитьПризнакОтображенияПредупрежденияLocal();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СохранитьПризнакОтображенияПредупрежденияLocal()
	
	УстановитьПривилегированныйРежим(Истина);
	
	ХранилищеНастроекДанныхФорм.Сохранить(
		"Обработка.уатЗагрузкаДанныхWialon", 
		"ПредупреждениеLocalБольшеНеПоказывать", 
		Истина
	);
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьТокенWialon()
	
	Если ПустаяСтрока(Объект.АдресСервиса) Тогда 
		ТекстОшибки = НСтр("ru = 'Необходимо заполнить адрес сервиса'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки,, "Объект.АдресСервиса");
		Возврат;
	КонецЕсли;
	
	ОткрытьФорму(
	"ОбщаяФорма.уатФормаАвторизацииWialon",
	Новый Структура("АдресСервиса, ВидСистемы",Объект.АдресСервиса, Объект.ВидСистемы),
	ЭтотОбъект,
	,
	,
	,
	Новый ОписаниеОповещения("ПолучитьТокенWialonЗавершение", ЭтотОбъект),
	РежимОткрытияОкнаФормы.БлокироватьОкноВладельца
	);
	
КонецПроцедуры

#КонецОбласти
